perf/load_testing/dictionary_1.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  payload:
    path: "dictionary.csv"  # Path to your dictionary CSV file
    fields:
      - "word"  # Assuming your CSV file contains a column named "word"
    loadAll: true
    name: dictionaryData  # Refer to the data as "dictionaryData"

  phases:
    - name: Stable
      duration: 30
      arrivalRate: 2
    - name: Ramp up
      duration: 60
      arrivalRate: 2
      rampTo: 10
    - name: Stable
      duration: 60
      arrivalRate: 10
    - name: Ramp down
      duration: 30
      arrivalRate: 10
      rampTo: 0

scenarios:
  - name: "Dictionary Test"
    flow:
      - loop:
          - get:
              url: "/dictionary?word={{ $loopElement.word }}"
        over: dictionaryData