perf/load_testing/ping_3.yaml
config:
  environments:
    api:
      target: 'http://localhost:3000'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Stable
      duration: 30
      arrivalRate: 2
    - name: Ramp up
      duration: 30
      arrivalRate: 2
      rampTo: 100
    - name: Stable
      duration: 60
      arrivalRate: 100
    - name: Ramp down
      duration: 30
      arrivalRate: 100
      rampTo: 80
    - name: Stable
      duration: 30
      arrivalRate: 80
    - name: Ramp up
      duration: 20
      arrivalRate: 80
      rampTo: 120
    - name: Stable
      duration: 30
      arrivalRate: 120
    - name: Ramp down
      duration: 10
      arrivalRate: 120
      rampTo: 90
    - name: Stable
      duration: 10
      arrivalRate: 90
    - name: Ramp down
      duration: 30
      arrivalRate: 90
      rampTo: 30
    - name: Stable
      duration: 5
      arrivalRate: 30
    - name: Ramp down
      duration: 10
      arrivalRate: 30
      rampTo: 0

    

scenarios:
  - name: "Ping Test"
    flow:
      - get:
          url: "/ping"
          expect:
            - statusCode: 200